<a href="https://colab.research.google.com/github/gjghwjdgh/Python/blob/master/csv_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
path = '/content/sample_data/'

In [0]:
import pandas as pd
df = pd.read_csv(path+'california_housing_train.csv')

In [11]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

# 국가보훈처 보훈의료 위탁병원 코로나-19 병원 정보
보훈대상자 의료 제공 위탁병원의 코로나-19 관련 병원 운영 현황 정보 등 제공 (국민안심병원, 감염병전담기관, 감염병전담기관 외래진료 정보) (제공주기) 코로나-19 관련 병원 운영 현황 변경 시 일자별 제공 (제공방법) 공공데이터 표준 포멧(CSV 파일) 형식 제공 (제공항목) 시군구, 의료기관명, 진료과수, 병상수, 전화번호, 주소, 국민안심병원 여부, 감염병전담기관 여부, 감염병전담기관 외래진료 가능여부 * 여부는 Y/N 표시

In [14]:
data_path ='/content/drive/My Drive/0_Dream/COVID.csv'
df2 = pd.read_csv(data_path, encoding='cp949')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 319 entries, 0 to 318
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   시군구                319 non-null    object
 1   의료기관명              319 non-null    object
 2   진료과수               319 non-null    int64
 3   병상수                319 non-null    int64
 4   전화번호               319 non-null    object
 5   주소                 319 non-null    object
 6   국민안심병원 여부          72 non-null     object
 7   감염병전담기관 여부         26 non-null     object
 8   감염병전담기관 외래진료 가능여부  26 non-null     object
dtypes: int64(2), object(7)
memory usage: 22.6+ KB

In [0]:
man = [[1,2,3],[3,2,3],[5,2,3]]

In [0]:
df3 = pd.DataFrame(man)

In [37]:
df3.index=['a','b','c']
df3.columns = ['1차','2차','3차']
df3

   1차  2차  3차
a   1   2   3
b   3   2   3
c   5   2   3

In [38]:
df4 = df3[['1차','2차']]
df4

   1차  2차
a   1   2
b   3   2
c   5   2

In [39]:
df3['1차'] == 1

a     True
b    False
c    False
Name: 1차, dtype: bool

In [41]:
df4['합계']=df3['1차']+df3['2차']
df4

   1차  2차  합계
a   1   2   3
b   3   2   5
c   5   2   7